odIfcUninitialize
\details
De-initializes IFC SDK functionality.
\returns eOk if IFC SDK was successfully de-initialized; otherwise, the function returns an appropriate error code.
\remarks
The function checks whether the needed modules are loaded and decreases the reference counters for them.
If a reference counter for any appropriate module becomes equal to zero, the function unloads the module.
If no IFC-related modules are loaded, the function returns the eNullPtr error code.